<a href="https://colab.research.google.com/github/tackulus/204426/blob/main/Lab_02_610510531.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Workshop 2: Pandas Library (2)**
**คำสั่ง** 

1.   ศึกษาวิธีการใช้งาน Pandas Library เบื้องต้นต่อไปนี้
2.   ทดลองใช้งานฟังก์ชันใน Pandas Library ตามคำสั่งปฏิบัติการแต่ละข้อ
3.   ตั้งชื่อไฟล์ python notebook นี้ในรูปแบบ Lab_02_XXXXXXXXX.ipynb โดย XXXXXXXXX คือ รหัสนักศึกษา
4.   ทำการดาวน์โหลดและส่งไฟล์ Lab_02_XXXXXXXXX.ipynb ที่เว็บไซต์ http://hw.cs.science.cmu.ac.th

In [1]:
%%capture
!wget -O adult.csv \
    https://raw.githubusercontent.com/tackulus/204426/main/dataset/adult.csv

In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({
    "A": ["A0", "A1", "A2", "A3"],
    "B": ["B0", "B1", "B2", "B3"],
    "C": ["C0", "C1", "C2", "C3"],
    "D": ["D0", "D1", "D2", "D3"],
},index=[0, 1, 2, 3])

In [4]:
df2 = pd.DataFrame({
    "A": ["A4", "A5", "A6", "A7"],
    "B": ["B4", "B5", "B6", "B7"],
    "C": ["C4", "C5", "C6", "C7"],
    "D": ["D4", "D5", "D6", "D7"],
},index=[4, 5, 6, 7])

In [5]:
df3 = pd.DataFrame({
    "A": ["A8", "A9", "A10", "A11"],
    "B": ["B8", "B9", "B10", "B11"],
    "C": ["C8", "C9", "C10", "C11"],
},index=[8, 9, 10, 11])

**การรวม data frames โดยการเพิ่มแถวข้อมูล**

In [6]:
# concatinate by row 
frames = [df1, df2, df3]
result = pd.concat(frames) 
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8  NaN
9    A9   B9   C9  NaN
10  A10  B10  C10  NaN
11  A11  B11  C11  NaN

In [7]:
# concatinate by row with key
result = pd.concat(frames, keys=["x", "y", "z"])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8  NaN
  9    A9   B9   C9  NaN
  10  A10  B10  C10  NaN
  11  A11  B11  C11  NaN

In [8]:
df4 = pd.DataFrame({
    "B": ["B2-df4", "B3-df4", "B6-df4", "B7-df4"],
    "D": ["D2-df4", "D3-df4", "D6-df4", "D7-df4"],
    "F": ["F2-df4", "F3-df4", "F6-df4", "F7-df4"],
},index=[2, 3, 6, 7])

In [9]:
# concatinate by row with ignore index
result = pd.concat([df1, df4], ignore_index=True, sort=False)
result

     A       B    C       D       F
0   A0      B0   C0      D0     NaN
1   A1      B1   C1      D1     NaN
2   A2      B2   C2      D2     NaN
3   A3      B3   C3      D3     NaN
4  NaN  B2-df4  NaN  D2-df4  F2-df4
5  NaN  B3-df4  NaN  D3-df4  F3-df4
6  NaN  B6-df4  NaN  D6-df4  F6-df4
7  NaN  B7-df4  NaN  D7-df4  F7-df4

**การรวม data frames โดยการเพิ่มคอลัมน์**

In [10]:
result = pd.concat([df1, df4], axis=1)
result

     A    B    C    D       B       D       F
0   A0   B0   C0   D0     NaN     NaN     NaN
1   A1   B1   C1   D1     NaN     NaN     NaN
2   A2   B2   C2   D2  B2-df4  D2-df4  F2-df4
3   A3   B3   C3   D3  B3-df4  D3-df4  F3-df4
6  NaN  NaN  NaN  NaN  B6-df4  D6-df4  F6-df4
7  NaN  NaN  NaN  NaN  B7-df4  D7-df4  F7-df4

ปฏิบัติการข้อ 1) จงรวมชุดข้อมูล adult ที่ถูกแยกออกเป็นส่วนๆ ได้แก่ d1  d2  d3  d4  และ d5 ให้อยู่ในตัวแปร data frames เดียว

In [11]:
data = pd.read_csv("adult.csv", na_values="?")
d1 = data.loc[0:1000,'age':'sex']
d2 = data.loc[1001:,'age':'sex']
d3 = data.loc[0:1000,'capital.gain':'native.country']
d4 = data.loc[1001:,'capital.gain':'native.country']
d5 = data.loc[:,['income']]

In [12]:
# Answer here!
dt1 = pd.concat([d1, d2])
dt2 = pd.concat([d3, d4])
df  = pd.concat([dt1, dt2, d5], axis=1)
df

       age workclass  fnlwgt  ... hours.per.week  native.country income
0       90       NaN   77053  ...             40   United-States  <=50K
1       82   Private  132870  ...             18   United-States  <=50K
2       66       NaN  186061  ...             40   United-States  <=50K
3       54   Private  140359  ...             40   United-States  <=50K
4       41   Private  264663  ...             40   United-States  <=50K
...    ...       ...     ...  ...            ...             ...    ...
32556   22   Private  310152  ...             40   United-States  <=50K
32557   27   Private  257302  ...             38   United-States  <=50K
32558   40   Private  154374  ...             40   United-States   >50K
32559   58   Private  151910  ...             40   United-States  <=50K
32560   22   Private  201490  ...             20   United-States  <=50K

[32561 rows x 15 columns]

**การเพิ่มแถวข้อมูลในตัวแปร data frame**

In [13]:
# append row without specify its key
for i in range(0,4):
  df1 = df1.append({'A': 'A'+str(i), 'B': 'B'+str(i), 'C':'C'+str(i), 'D':'D'+str(i)},ignore_index=True)
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A0  B0  C0  D0
5  A1  B1  C1  D1
6  A2  B2  C2  D2
7  A3  B3  C3  D3

In [14]:
# append row with specify its key
for i in range(0,4):
  df2 = df2.append(pd.DataFrame({'A': 'A'+str(i), 'B': 'B'+str(i), 'C':'C'+str(i), 'D':'D'+str(i)},index=[i]))
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

ปฏิบัติการข้อ 2) จงเพิ่มข้อมูลจำนวน 10 ข้อมูลต่อไปนี้ ลงในตัวแปร data frame ชื่อ bill


1.   'The Riddler', 'Restaurant', 29.02
2.   'Smitten Ice Cream', 'Restaurant', 98.60
3.   'Suppenkuche', 'Restaurant', 40.23
4.   'Maven', 'bar', 45.20

In [15]:
bill = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill'))
bill

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [16]:
nameList = ['The Riddler','Smitten Ice Cream','Suppenkuche','Maven']
typeList = ['Restaurant',  'Restaurant',  'Restaurant', 'bar']
AvgBill = [29.02,98.60,40.23,45.20]

In [17]:
# Answer here!
for namex, typex, avgx in zip(nameList, typeList, AvgBill):
    temp = pd.DataFrame({'name': namex, 'type': typex, 'AvgBill': avgx}, index=[0])
    bill = bill.append(temp, ignore_index=True)
bill

                name        type  AvgBill
0     Foreign Cinema  Restaurant   289.00
1          Liho Liho  Restaurant   224.00
2           500 Club         bar    80.50
3         The Square         bar    25.30
4        The Riddler  Restaurant    29.02
5  Smitten Ice Cream  Restaurant    98.60
6        Suppenkuche  Restaurant    40.23
7              Maven         bar    45.20

**การลบแถวข้อมูล**

In [18]:
# delete a single row by index value 0
df1 = df1.drop(labels=0, axis=0)
df1

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A0  B0  C0  D0
5  A1  B1  C1  D1
6  A2  B2  C2  D2
7  A3  B3  C3  D3

In [19]:
# delete a few specified rows
df1 = df1.drop(labels=[1,3], axis=0)
df1

    A   B   C   D
2  A2  B2  C2  D2
4  A0  B0  C0  D0
5  A1  B1  C1  D1
6  A2  B2  C2  D2
7  A3  B3  C3  D3

ปฏิบัติการข้อ 3) จงลบข้อมูลแถว*เลขคู่*ทั้งหมดจากตัวแปร data

In [20]:
# Answer here!
df = data.drop(labels=[n for n in range(len(data)) if n % 2 == 0])
df

       age         workclass  fnlwgt  ... hours.per.week  native.country income
1       82           Private  132870  ...             18   United-States  <=50K
3       54           Private  140359  ...             40   United-States  <=50K
5       34           Private  216864  ...             45   United-States  <=50K
7       74         State-gov   88638  ...             20   United-States   >50K
9       41           Private   70037  ...             60             NaN   >50K
...    ...               ...     ...  ...            ...             ...    ...
32551   43  Self-emp-not-inc   27242  ...             50   United-States  <=50K
32553   43           Private   84661  ...             45   United-States  <=50K
32555   53           Private  321865  ...             40   United-States   >50K
32557   27           Private  257302  ...             38   United-States  <=50K
32559   58           Private  151910  ...             40   United-States  <=50K

[16280 rows x 15 columns]

**การลบคอลัมน์ของตัวแปร data frame**

In [21]:
# Delete a single column from the DataFrame
df1 = df1.drop(labels="A", axis=1)
df1

    B   C   D
2  B2  C2  D2
4  B0  C0  D0
5  B1  C1  D1
6  B2  C2  D2
7  B3  C3  D3

In [22]:
# Delete multiple columns from the DataFrame
df1 = df1.drop(labels=["C", "D"], axis=1)
df1

    B
2  B2
4  B0
5  B1
6  B2
7  B3

In [23]:
# Delete a single named column from the DataFrame
df2 = df2.drop(columns="A")
df2

    B   C   D
4  B4  C4  D4
5  B5  C5  D5
6  B6  C6  D6
7  B7  C7  D7
0  B0  C0  D0
1  B1  C1  D1
2  B2  C2  D2
3  B3  C3  D3

In [24]:
# Delete a column by column number
df2.drop(columns=df2.columns[2], inplace=True)
df2

    B   C
4  B4  C4
5  B5  C5
6  B6  C6
7  B7  C7
0  B0  C0
1  B1  C1
2  B2  C2
3  B3  C3

ปฏิบัติการข้อ 4) จงลบคอลัมน์ข้อมูล marital.status  relationship  และ native.country ของตัวแปร data

In [25]:
# Answer here!
df = data.drop(columns=["marital.status", "relationship", "native.country"])
df

       age workclass  fnlwgt  ... capital.loss  hours.per.week income
0       90       NaN   77053  ...         4356              40  <=50K
1       82   Private  132870  ...         4356              18  <=50K
2       66       NaN  186061  ...         4356              40  <=50K
3       54   Private  140359  ...         3900              40  <=50K
4       41   Private  264663  ...         3900              40  <=50K
...    ...       ...     ...  ...          ...             ...    ...
32556   22   Private  310152  ...            0              40  <=50K
32557   27   Private  257302  ...            0              38  <=50K
32558   40   Private  154374  ...            0              40   >50K
32559   58   Private  151910  ...            0              40  <=50K
32560   22   Private  201490  ...            0              20  <=50K

[32561 rows x 12 columns]

**การเปลี่ยนชื่อคอลัมน์**

In [26]:
df3.rename(columns = {"A":"AA", "B":"BB"}, inplace = True)
df3

     AA   BB    C
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

ปฏิบัติการข้อ 5) จงเปลี่ยนชื่อคอลัมน์ของตัวแปร data ที่มีสัญลักษณ์ . ในชื่อคอลัมน์ โดยเปลี่ยนจากเครื่องหมาย . เป็นเครื่องหมาย _

In [27]:
# Answer here!
new_names = {name: name.replace(".", "_") for name in data.columns}
df = data.rename(columns=new_names)
df

       age workclass  fnlwgt  ... hours_per_week  native_country income
0       90       NaN   77053  ...             40   United-States  <=50K
1       82   Private  132870  ...             18   United-States  <=50K
2       66       NaN  186061  ...             40   United-States  <=50K
3       54   Private  140359  ...             40   United-States  <=50K
4       41   Private  264663  ...             40   United-States  <=50K
...    ...       ...     ...  ...            ...             ...    ...
32556   22   Private  310152  ...             40   United-States  <=50K
32557   27   Private  257302  ...             38   United-States  <=50K
32558   40   Private  154374  ...             40   United-States   >50K
32559   58   Private  151910  ...             40   United-States  <=50K
32560   22   Private  201490  ...             20   United-States  <=50K

[32561 rows x 15 columns]

**การเลือกตัวแปรหนึ่งเป็นค่า index ของข้อมูล**

In [28]:
# set a single index
df3.set_index("C",inplace = True)
df3

      AA   BB
C
C8    A8   B8
C9    A9   B9
C10  A10  B10
C11  A11  B11

In [29]:
# set multiple indexes
df4.set_index(["B","D"],inplace = True)
df4

                    F
B      D
B2-df4 D2-df4  F2-df4
B3-df4 D3-df4  F3-df4
B6-df4 D6-df4  F6-df4
B7-df4 D7-df4  F7-df4

ปฏิบัติการข้อ 6) จงตั้งค่าให้ตัวแปร fnlwgt เป็น index ของตัวแปร data

In [30]:
# Answer here!
df = data.set_index("fnlwgt")
df

        age workclass     education  ...  hours.per.week native.country income
fnlwgt                               ...
77053    90       NaN       HS-grad  ...              40  United-States  <=50K
132870   82   Private       HS-grad  ...              18  United-States  <=50K
186061   66       NaN  Some-college  ...              40  United-States  <=50K
140359   54   Private       7th-8th  ...              40  United-States  <=50K
264663   41   Private  Some-college  ...              40  United-States  <=50K
...     ...       ...           ...  ...             ...            ...    ...
310152   22   Private  Some-college  ...              40  United-States  <=50K
257302   27   Private    Assoc-acdm  ...              38  United-States  <=50K
154374   40   Private       HS-grad  ...              40  United-States   >50K
151910   58   Private       HS-grad  ...              40  United-States  <=50K
201490   22   Private       HS-grad  ...              20  United-States  <=50K

[32561 rows x 14 columns]